snlkuharlocal/src/Documents/Перемаркировка/Перемаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перемаркировка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПеремаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыУдаленные</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокОснование</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКомплектов</name>
    <attributes>
      <name>ВидКомплекта</name>
      <type>
        <types>EnumRef.ВидыКомплектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКарточкиНоменклатурыВЧЗ/СтатусыКарточкиНоменклатурыВЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКарточкиНоменклатурыВЧЗ</name>
  <enumValues>
    <name>НеПодлежитМаркировке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкевНК</name>
  </enumValues>
  <enumValues>
    <name>НеСоздана</name>
  </enumValues>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>НаМодерации</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодписания</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыВводаВОборотСУЗ/СпособыВводаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВРФ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыПеремаркировки/СтатусыПеремаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПеремаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтработкеЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОбработаноЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Перемаркировка/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции
Функция СоздатьЗаказыКодовМаркировки(Знач ДокПеремаркировки)Экспорт
	//если статус к отработке, то нельзя менять, только в состоянии в работе 
	//если в работе, то пометим на удаление и заново создадим
	РезультатСоздания = МаркировкаКС.СтруктураРезультата(ложь);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Статус КАК Статус
	|ПОМЕСТИТЬ ВТОсновныеЗаказыКМ
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен
	|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОсновныеЗаказыКМ.ссылка КАК Ссылка,
	|	ВТОсновныеЗаказыКМ.Статус КАК Статус
	|ИЗ
	|	ВТОсновныеЗаказыКМ КАК ВТОсновныеЗаказыКМ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ссылка,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Статус
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеЗаказыКМ КАК ВТОсновныеЗаказыКМ
	|		ПО ВТОсновныеЗаказыКМ.ссылка = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование
	|ГДЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен";

	Запрос.УстановитьПараметр("ДокументОснование", ДокПеремаркировки);
	Выборка = Запрос.Выполнить().Выбрать(); 
	НачатьТранзакцию();
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
			ТекстОшибки = СтрШаблон("Заказ КМ %1 в статусе отличном от ""в работе"": статус %2", Выборка.ссылка,
				Выборка.Статус);
			РезультатСоздания.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
		ВыбОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//ВыбОбъект.ОбменДанными.Загрузка = истина; 
		ВыбОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
		ВыбОбъект.УстановитьПометкуУдаления(истина);  
	КонецЦикла;
	Если РезультатСоздания.Ошибки.Количество() = 0 Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		ОбщегоНазначенияС.ЗаписатьВЛогНаСервере("Заказ КМ Перемаркировка", СтрСоединить(РезультатСоздания.Ошибки, ";"),
			"Ошибка");
		Возврат РезультатСоздания;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремаркировкаТовары.Номенклатура КАК Номенклатура,
	|	ПеремаркировкаТовары.Количество КАК Количество,
	|	ПеремаркировкаТовары.Номенклатура.Родитель.ВидКомплекта КАК ВидКомплекта
	|ИЗ
	|	Документ.Перемаркировка.Товары КАК ПеремаркировкаТовары
	|ГДЕ
	|	ПеремаркировкаТовары.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ВидКомплекта"; 

	Запрос.УстановитьПараметр("Ссылка", ДокПеремаркировки.ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЧастиПоВидамКомплектов = Новый Соответствие;
	Пока ВыборкаИтоги.Следующий() Цикл

		ВыборкаТовары = ВыборкаИтоги.Выбрать(); 
		
		СтрокаНаДокумент 		= 5; 
		МаксКоличествоПоПозиции = 5000;
		Части 					= Новый Массив;
		Пока ВыборкаТовары.Следующий() Цикл
			НадоСписать 	= ВыборкаТовары.Количество;
			Номенклатура 		= ВыборкаТовары.Номенклатура;

			Пока НадоСписать > 0 Цикл

				ТекКол = Макс(0, Мин(НадоСписать, МаксКоличествоПоПозиции));
				Если ТекКол > 0 Тогда
					ТекЧасть = Неопределено;
					Для Каждого Часть Из Части Цикл
						Если Часть.Количество() < СтрокаНаДокумент И Часть[Номенклатура] = Неопределено Тогда
							ТекЧасть = Часть;
							Прервать;
						КонецЕсли;
					КонецЦикла;

					Если ТекЧасть = Неопределено Тогда
						ТекЧасть = Новый Соответствие;
						Части.Добавить(ТекЧасть);
					КонецЕсли;

					ТекЧасть[Номенклатура] = ТекКол;
					НадоСписать = НадоСписать - ТекКол;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ТЧасть = Новый ТаблицаЗначений;
		ТЧасть.Колонки.Добавить("Часть", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(9, 0)));
		ТЧасть.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЧасть.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(12, 0)));
		
		Счетчик = 1;

		Для Каждого Часть Из Части Цикл
			Для Каждого КиЗ Из Часть Цикл
				СтрокаТР = ТЧасть.Добавить();

				СтрокаТР.Часть 			= Счетчик;
				СтрокаТР.Номенклатура   = КиЗ.Ключ;

				Количество 			= КиЗ.Значение;
				СтрокаТР.Количество		= Количество;				

			КонецЦикла;
			Счетчик=Счетчик + 1;
		КонецЦикла;

		ЧастиПоВидамКомплектов.Вставить(ВыборкаИтоги.ВидКомплекта,ТЧасть);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремаркировкаКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(ПеремаркировкаКомплектующие.Количество) КАК Количество
	|ИЗ
	|	Документ.Перемаркировка.Комплектующие КАК ПеремаркировкаКомплектующие
	|ГДЕ
	|	ПеремаркировкаКомплектующие.Ссылка = &Ссылка
	|	И ПеремаркировкаКомплектующие.Номенклатура.Родитель.ТНВЭД <> ЗНАЧЕНИЕ(Справочник.ТНВЭД.ПустаяСсылка)
	|	И ПеремаркировкаКомплектующие.Номенклатура.Родитель.ВидНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.ПустаяСсылка))
	|	И НЕ
	|		(ПеремаркировкаКомплектующие.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	|	ИЛИ
	|		ПеремаркировкаКомплектующие.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
	|СГРУППИРОВАТЬ ПО
	|	ПеремаркировкаКомплектующие.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", ДокПеремаркировки);

	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого ЧастьПоВидамКомплектов  Из ЧастиПоВидамКомплектов Цикл
		ВидКомплектаЗаказа = ЧастьПоВидамКомплектов.Ключ; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Части ИЗ &Части КАК Части
		|;		
		|ВЫБРАТЬ
		|	Номенклатура.ГТИН КАК ГТИН,
		|	*
		|ИЗ
		|	ВТ_Части
		|ИТОГИ ПО
		|	Часть
		|";
		
		Запрос.УстановитьПараметр("Части",ЧастьПоВидамКомплектов.Значение);	 
		
		//@skip-check query-in-loop
		РЗапроса 		= Запрос.Выполнить(); 	
		 
		Выборка_Часть 	= РЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Часть");	
				
		Пока Выборка_Часть.Следующий() Цикл
			
			ДокОбъект = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
			
			ДокОбъект.Дата	= ТекущаяДатаСеанса();
			ДокОбъект.Заполнить(ДокПеремаркировки);
			ДокОбъект.ПодразделениеНанесения = ДокПеремаркировки.Подразделение;
			ДокОбъект.Организация 				= ДокПеремаркировки.Организация;
			ДокОбъект.СпособВводаВОборот = ?(ВидКомплектаЗаказа = Перечисления.ВидыКомплектов.Товар,
				Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка, Перечисления.СпособыВводаВОборотСУЗ.Производство); 
			//++Данилова Е.В. 26.06.2026 Изм.№0000000222
			//для автомат. отработки регламента 
			//ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке;
			ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе;
			//--Данилова Е.В. 26.06.2026
			ДокОбъект.СозданАвтоматически = Истина;

			ДокОбъект.Комментарий	= "Создание Заказа по перемаркировке";
			
			ДокОбъект.Товары.Очистить();
			
			Выборка = Выборка_Часть.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЧ = ДокОбъект.Товары.Добавить();			
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			КонецЦикла;			
			 
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				РезультатСоздания.Ошибки.Добавить(ОписаниеОшибки());
				
				//Возврат Результат;
				 
			КонецПопытки;
			
			РезультатСоздания.ОбработаноОбъектов = РезультатСоздания.ОбработаноОбъектов + 1;
			РезультатСоздания.Данные.Добавить(ДокОбъект.Ссылка);
			
			Если ВидКомплектаЗаказа = Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
				//++Данилова Е.В. 26.06.2026 Изм.№0000000222
				//для автомат. отработки регламента
				//РезультатОтработки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьЗаказыКМКомплектующие(ДокОбъект.Ссылка,,,Перечисления.СтатусыДокументовМаркировки.КОбработке);
				РезультатОтработки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьЗаказыКМКомплектующие(ДокОбъект.Ссылка,,,Перечисления.СтатусыДокументовМаркировки.ВРаботе);
				//--Данилова Е.В. 26.06.2026 
				Если РезультатОтработки.Успешно Тогда
					
					Для каждого ДокументОтработки Из РезультатОтработки.Данные Цикл
						
						РезультатСоздания.Данные.Добавить(ДокументОтработки);
						
					КонецЦикла;	
				ИначеЕсли  РезультатОтработки.Ошибки.Количество() > 0 Тогда  
					
					Для каждого ОшибкаОтработки Из РезультатОтработки.Ошибки Цикл
						
						РезультатСоздания.Ошибки.Добавить(ОшибкаОтработки);
						
					КонецЦикла;
				КонецЕсли;
			ИначеЕсли ВидКомплектаЗаказа = Перечисления.ВидыКомплектов.Комплект Тогда
				//++Данилова Е.В. 24.06.2026 Проб.№0000000129
				ТаблицаКомплектующих = ПолучитьТаблицуКомплектующихПоЗаказуКМ(ДокОбъект.Ссылка,ДокПеремаркировки); 
				//--Данилова Е.В. 24.06.2026  
				//++Данилова Е.В. 26.06.2026 Изм.№0000000222
				//для автомат. отработки регламента
				//РезультатОтработки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьЗаказыКМКомплектующие(
				//	ДокОбъект.Ссылка,ВидКомплектаЗаказа,ТаблицаКомплектующих,Перечисления.СтатусыДокументовМаркировки.КОбработке); 
				РезультатОтработки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьЗаказыКМКомплектующие(
					ДокОбъект.Ссылка,ВидКомплектаЗаказа,ТаблицаКомплектующих,Перечисления.СтатусыДокументовМаркировки.ВРаботе);
					//--Данилова Е.В. 26.06.2026 
				Если РезультатОтработки.Успешно Тогда

					Для Каждого ДокументОтработки Из РезультатОтработки.Данные Цикл

						РезультатСоздания.Данные.Добавить(ДокументОтработки);

					КонецЦикла;
				ИначеЕсли РезультатОтработки.Ошибки.Количество() > 0 Тогда

					Для Каждого ОшибкаОтработки Из РезультатОтработки.Ошибки Цикл

						РезультатСоздания.Ошибки.Добавить(ОшибкаОтработки);

					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЦикла;
	РезультатСоздания.Успешно =  РезультатСоздания.Ошибки.Количество() = 0; 
	Если РезультатСоздания.Ошибки.Количество() > 0 Тогда
		
		ОбщегоНазначенияС.ЗаписатьВЛогНаСервере("Заказ КМ Перемаркировка","Ошибка создания заказа КМ" + СтрСоединить(РезультатСоздания.Ошибки,";"),"Ошибка"); 
		
	КонецЕсли;
	Возврат РезультатСоздания; 
	
КонецФункции

Функция ВернутьКоличествоНеобходимыхЗаказовКМ(Знач ДокПеремаркировки)
	МассивВидовКомплектов = Новый Массив; 
	Если ДокПеремаркировки.ВидыКомплектов.Количество() > 0 
	 И ДокПеремаркировки.ВидыКомплектов[0].ВидКомплекта = Перечисления.ВидыКомплектов.Комплект  Тогда
	 	МассивВидовКомплектов.Добавить(Перечисления.ВидыКомплектов.Комплект);
	 	//МассивВидовКомплектов.Добавить(Перечисления.ВидыКомплектов.Товар);
		Возврат МассивВидовКомплектов; 
	Иначе 
		
		Для Каждого СтрокаВидКомплекта Из ДокПеремаркировки.ВидыКомплектов Цикл
//			Если СтрокаВидКомплекта.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
//				МассивВидовКомплектов.Добавить(Перечисления.ВидыКомплектов.ГотовыйКомплект); 
//				МассивВидовКомплектов.Добавить(Перечисления.ВидыКомплектов.Товар);
//			Иначе 
//				МассивВидовКомплектов.Добавить(Перечисления.ВидыКомплектов.Товар);
//			КонецЕсли;
			МассивВидовКомплектов.Добавить(СтрокаВидКомплекта.ВидКомплекта); 
		КонецЦикла; 
		Возврат МассивВидовКомплектов; 
	КонецЕсли;
КонецФункции

Процедура УстановитьПолучателейИзменений(ДокОбъект)	Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	МПолучателей = СписокПолучателейИзменений(ДокОбъект);
	Для Каждого УзелПолучатель Из МПолучателей Цикл
		ДокОбъект.ОбменДанными.Получатели.Добавить(УзелПолучатель);
	КонецЦикла;
КонецПроцедуры

Функция СписокПолучателейИзменений(ДокОбъект, ДопИнфо = Неопределено)
	СписокПолучателей = Новый Массив;	
	
	ТипУзла				= Маркировка_ПИ.ТипТекущегоУзла();		

	УправляющийУзел		= Маркировка_ПИ.УправляющийУзел();	
	
	ОбменДанными		= ДокОбъект.ОбменДанными;
	Отправитель			= ОбменДанными.Отправитель;
	Загрузка			= ОбменДанными.Загрузка;
	
	УзелСклада			= ПланыОбмена.Основной.ПустаяСсылка();	
	Подразделение		= ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ДокОбъект.ссылка, "Подразделение");
	УзелСклада			= Маркировка_ПИ.УзелПодразделения(Подразделение);
	
	Если ДокОбъект.Статус = Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ И ТипУзла
		= Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		
		МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УзелСклада, Отправитель, Загрузка);
		ИдентификаторФЗ = Новый УникальныйИдентификатор;
		//++Данилова Е.В. 26.06.2026 Изм.№0000000222
//		МаркировкаС.ИзменитьСтатусПеремаркировкиВФоне(ДокОбъект.ссылка, ДокОбъект.ВерсияДанных, ИдентификаторФЗ,
//			Перечисления.СтатусыПеремаркировки.ПолученоСкладом); 
		МаркировкаС.ИзменитьСтатусПеремаркировкиВФоне(ДокОбъект.ссылка, ДокОбъект.ВерсияДанных, ИдентификаторФЗ,
			Перечисления.СтатусыПеремаркировки.КОтправкеНаСклад); 
		//--Данилова Е.В. 26.06.2026 
	//++Данилова Е.В. 26.06.2026 Изм.№0000000222
//	ИначеЕсли ДокОбъект.Статус = Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ И ТипУзла
//		= Перечисления.ТипУзлаИБ.Склад Тогда
	ИначеЕсли (ДокОбъект.Статус = Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ Или ДокОбъект.Статус
		= Перечисления.СтатусыПеремаркировки.ПолученоСкладом) И ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
			//--Данилова Е.В. 26.06.2026 
		МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УправляющийУзел, Отправитель, Загрузка);
	КонецЕсли;
	
	Возврат ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(СписокПолучателей, Истина);	
КонецФункции //СписокПолучателейИзменений(ДокОбъект, ДопИнфо = Неопределено)

Функция НужноВыгружатьДокПеремаркировка(Модифицированность,Ссылка,РежимЗаписи,ПометкаУдаления) Экспорт
	РеквизитыШапки=ОбщегоНазначенияС.ПолучитьРеквизитыШапкиСервер(Ссылка, Новый Структура("ПометкаУдаления,Проведен"),
		"Документ");

	Если Модифицированность Или (Не РеквизитыШапки.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение)
		Или (РеквизитыШапки.Проведен И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)
		Или РеквизитыШапки.ПометкаУдаления <> ПометкаУдаления Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция СоздатьЗНМ_И_ЛМ(Знач ДокПеремаркировки) Экспорт
	ЗНМСозданный 	= неопределено; 
		
	СтруктураРезультат = МаркировкаКС.СтруктураРезультата(Ложь); 	
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаМаркировку.Ссылка КАК Ссылка,
	|	ЗаданиеНаМаркировку.СостояниеНакладной КАК СостояниеНакладной
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
	|ГДЕ
	|	ЗаданиеНаМаркировку.Проведен
	|	И ЗаданиеНаМаркировку.ДокОснование = &ДокОснование"; 		
    Запрос.УстановитьПараметр("ДокОснование", ДокПеремаркировки);
    Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке
			ИЛИ Выборка.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
			
			ТекстОшибки = СтрШаблон("Редактирование ЗНМ в статусе %1 запрещено, ЗНМ %2",Выборка.СостояниеНакладной, Выборка.ссылка); 	
			СтруктураРезультат.Ошибки.Добавить(ТекстОшибки);
			Возврат СтруктураРезультат;
		КонецЕсли;
		
		//СтруктураРезультат.Успешно = Истина;
		//СтруктураРезультат.Данные.Добавить(Выборка.ссылка);  
		//
		//Возврат СтруктураРезультат;
		ЗНМСозданный = Выборка.ссылка.ПолучитьОбъект(); 
		
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПеремаркировкаТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПеремаркировкаТовары.Количество) КАК Количество,
	|	ПеремаркировкаТовары.Номенклатура.ОсновнаяЕдиница КАК Единица,
	|	ПеремаркировкаТовары.Номенклатура.Коэффициент КАК Коэффициент
	|ИЗ
	|	Документ.Перемаркировка.Товары КАК ПеремаркировкаТовары
	|ГДЕ
	|	ПеремаркировкаТовары.Ссылка = &ссылка
	|	И ПеремаркировкаТовары.Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО
	|	ПеремаркировкаТовары.Номенклатура,
	|	ПеремаркировкаТовары.Номенклатура.ОсновнаяЕдиница,
	|	ПеремаркировкаТовары.Номенклатура.Коэффициент
	|ИМЕЮЩИЕ
	|	СУММА(ПеремаркировкаТовары.Количество) > 0";
				   
	
	Запрос.УстановитьПараметр("Ссылка", ДокПеремаркировки);
	Запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаРедактирования.Получить());
	
	ТаблицаТовары = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаТовары.Количество() = 0 Тогда
		
		СтруктураРезультат.Ошибки.Добавить("Не найдены товары для создания ЗНМ"); 
		
		Возврат СтруктураРезультат;
		
	КонецЕсли;
	Если ЗНМСозданный = неопределено Тогда
		
		ЗНМОбъект = Документы.ЗаданиеНаМаркировку.СоздатьДокумент();
		
	Иначе 
		ЗНМОбъект = ЗНМСозданный;
		ЗНМОбъект.Товары.Очистить();
		ЗНМОбъект.ШтрихкодыУпаковок.Очистить(); 
		//++Данилова Е.В. 25.06.2026  Проб.№0000000148
		РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(ЗНМОбъект.Ссылка);
		//--Данилова Е.В. 25.06.2026 
	КонецЕсли;
	
			
	ОбщегоНазначенияС.ЗаполнитьШапкуДокументаСервер(ЗНМОбъект, ПараметрыСеанса.Пользователь);
	
	ЗНМОбъект.Автор = ПараметрыСеанса.Пользователь;
	ЗНМОбъект.Дата = ТекущаяДатаСеанса();
	ЗНМОбъект.ДокОснование = ДокПеремаркировки;
	ЗНМОбъект.Подразделение = ДокПеремаркировки.Подразделение; 
	ЗНМОбъект.Товары.Загрузить(ТаблицаТовары);	
	ЗНМОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ДопПараметры = Новый Структура("Статус, Местонахождение, Добавлять",
	Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати, ЗНМОбъект.Подразделение, Истина);
		
	РПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(ТаблицаТовары, ЗНМОбъект.Ссылка, ДопПараметры);		
	
	Если рПолучения.Успешно Тогда
		
		Для Каждого СтрокаДанных Из рПолучения.Данные Цикл
			
			Для Каждого ШтрихкодУпаковки Из СтрокаДанных.Значение Цикл
				
				СтрШтрихкодыУпаковок = ЗНМОбъект.ШтрихкодыУпаковок.Добавить();
				
				СтрШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодУпаковки;
				
			КонецЦикла;		
			
		КонецЦикла;			
		
		ЗНМОбъект.Записать(РежимЗаписиДокумента.Запись);
		СтруктураРезультат.Данные.Добавить(ЗНМОбъект.ссылка);
	Иначе
		
		РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(ЗНМОбъект.Ссылка); 
		
		ОшибкиПолученияКодов = СтрСоединить(рПолучения.Ошибки, Символы.ПС);		
		
		ТекстСообщения = СтрШаблон(
		"Недостаточно кодов ЧЗ для ЗНМ: %1, Перемаркировка: %2 !", ЗНМОбъект.ссылка, ДокПеремаркировки
		);
		
		ТекстСообщения = ТекстСообщения + "
		|" + ОшибкиПолученияКодов;
		
		СтруктураРезультат.Ошибки.Добавить(ТекстСообщения);
		
	КонецЕсли;		
	
	Если СтруктураРезультат.Ошибки.Количество() = 0 Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистМаркировки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистМаркировки КАК ЛистМаркировки
		|ГДЕ
		|	ЛистМаркировки.Проведен
		|	И ЛистМаркировки.ДокОснование = &ДокОснование";
		
		Запрос.УстановитьПараметр("ДокОснование",  ЗНМОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			ЛМОбъект = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
			ЛМОбъект.ШтрихкодыУпаковок.Очистить(); 
		Иначе
			ЛМОбъект = Документы.ЛистМаркировки.СоздатьДокумент();
		КонецЕсли;	
		
		
		ОбщегоНазначенияС.ЗаполнитьШапкуДокументаСервер(ЛМОбъект, ПараметрыСеанса.Пользователь);
		
		ЛМОбъект.Автор = ПараметрыСеанса.Пользователь;
		
		ЛМОбъект.Дата = ТекущаяДатаСеанса() + 1;		
		
		ЛМОбъект.ДокОснование = ЗНМОбъект.Ссылка;
		ЛМОбъект.Подразделение = ДокПеремаркировки.Подразделение; 
		
		Для Каждого Стр Из ЗНМОбъект.ШтрихкодыУпаковок Цикл
			
			СтрШтрихкодыУпаковок = ЛМОбъект.ШтрихкодыУпаковок.Добавить();
			
			СтрШтрихкодыУпаковок.ШтрихкодУпаковки = Стр.ШтрихКодУпаковки;
			
		КонецЦикла;
		
		ЛМОбъект.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураРезультат.Данные.Добавить(ЛМОбъект.ссылка);
	Иначе
				
		Для Каждого ТекстСообщения Из СтруктураРезультат.Ошибки Цикл
			
			ОбщегоНазначенияС.ЗаписатьВЛогНаСервере("Нехватка КМ", ТекстСообщения, "Ошибка");
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	СтруктураРезультат.Успешно = СтруктураРезультат.Ошибки.Количество() = 0; 
	
	Возврат СтруктураРезультат; 
	
КонецФункции

Функция СоздатьЗСБ_И_ЛСК(Знач ДокПеремаркировки) Экспорт 
	ЗСБСозданный = неопределено; 
	ЛСКСозданный = неопределено; 
	
	СтруктураРезультата = МаркировкаКС.СтруктураРезультата(Ложь);	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаданиеНаСборкуКомплектовЧЗ.Ссылка КАК Ссылка,
		|	ЗаданиеНаСборкуКомплектовЧЗ.СостояниеНакладной КАК СостояниеНакладной
		|ИЗ
		|	Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗаданиеНаСборкуКомплектовЧЗ
		|ГДЕ
		|	ЗаданиеНаСборкуКомплектовЧЗ.Проведен
		|	И ЗаданиеНаСборкуКомплектовЧЗ.ДокОснование = &ДокОснование";
	
	
	Запрос.УстановитьПараметр("ДокОснование", ДокПеремаркировки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке
			ИЛИ ВыборкаДетальныеЗаписи.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
			
			ТекстОшибки = СтрШаблон("Редактирование ЗСБ в статусе %2 запрещено, ЗСБ %2",ВыборкаДетальныеЗаписи.СостояниеНакладной, ВыборкаДетальныеЗаписи.ссылка); 	
			СтруктураРезультата.Ошибки.Добавить(ТекстОшибки);
			Возврат СтруктураРезультата;
		КонецЕсли;
		
		//СтруктураРезультата.Успешно = истина; 
		//СтруктураРезультата.Данные.Добавить(ВыборкаДетальныеЗаписи.ссылка); 
		//Возврат СтруктураРезультата; 
		ЗСБСозданный = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект(); 
		
	КонецЕсли;
	
	Если ЗСБСозданный = неопределено Тогда
		
		ДокументЗСБ_Объект = Документы.ЗаданиеНаСборкуКомплектовЧЗ.СоздатьДокумент();
		
	Иначе 
		
		ДокументЗСБ_Объект = ЗСБСозданный;
		ДокументЗСБ_Объект.Товары.Очистить();
		ДокументЗСБ_Объект.Комплектующие.Очистить(); 
		ДокументЗСБ_Объект.ШтрихкодыУпаковок.Очистить();
		
		РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(ДокументЗСБ_Объект.Ссылка); // Кельманов А.В. - ПРО-0000000141 - 2026.06.24
		
	КонецЕсли; 
	
	ДокументЗСБ_Объект.Заполнить(ДокПеремаркировки);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПеремаркировкаТовары.Номенклатура КАК Номенклатура,
		|	ПеремаркировкаТовары.Количество КАК Количество,
		|	ПеремаркировкаТовары.Номенклатура.ОсновнаяЕдиница КАК Единица,
		|	1 КАК Коэффициент
		|ИЗ
		|	Документ.Перемаркировка.Товары КАК ПеремаркировкаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемаркировка КАК Перемаркировка
		|		ПО ПеремаркировкаТовары.Ссылка = Перемаркировка.Ссылка
		|ГДЕ
		|	Перемаркировка.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремаркировкаТовары.Номенклатура КАК Номенклатура,
		|	ПеремаркировкаТовары.Количество КАК Количество,
		|	ПеремаркировкаТовары.Номенклатура.ОсновнаяЕдиница КАК Единица,
		|	1 КАК Коэффициент,
		|	ПеремаркировкаТовары.Продукция КАК Продукция
		|ИЗ
		|	Документ.Перемаркировка.Комплектующие КАК ПеремаркировкаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемаркировка КАК Перемаркировка
		|		ПО ПеремаркировкаТовары.Ссылка = Перемаркировка.Ссылка
		|ГДЕ
		|	Перемаркировка.Ссылка = &Ссылка
		|	И ПеремаркировкаТовары.Номенклатура.Родитель.ТНВЭД <> ЗНАЧЕНИЕ(Справочник.ТНВЭД.ПустаяСсылка)
		|	И ПеремаркировкаТовары.Номенклатура.Родитель.ВидНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар), ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.ПустаяСсылка))
		|	И НЕ(ПеремаркировкаТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
		|				ИЛИ ПеремаркировкаТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))";
	
	Запрос.УстановитьПараметр("Ссылка", ДокПеремаркировки);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ТЧТовары = ПакетЗапросов[0].Выгрузить(); 
	
	ДокументЗСБ_Объект.Товары.Загрузить(ТЧТовары);
	ДокументЗСБ_Объект.Комплектующие.Загрузить(ПакетЗапросов[1].Выгрузить()); 
	
	ДокументЗСБ_Объект.Записать();
	
	ДопПараметры=Новый Структура("НовыйСтатус,ТипКода,Добавлять",
		Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован, Перечисления.ТипыКодовМаркировки.Набор, Истина);

	МассивНоменклатуры = ТЧТовары.ВыгрузитьКолонку("Номенклатура");
	РезультатПолученияКодов=Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(
		ТЧТовары, ДокументЗСБ_Объект.Ссылка, ДопПараметры);
	Если Не РезультатПолученияКодов.Успешно Тогда		
		СтруктураРезультата.Успешно = Ложь;
		СтруктураРезультата.Ошибки.Добавить(СтрСоединить(РезультатПолученияКодов.Ошибки, символы.ПС)); 
		Возврат СтруктураРезультата;
	Иначе
		Для Каждого Номенклатура Из МассивНоменклатуры Цикл
			Для Каждого СтрокаДанных Из РезультатПолученияКодов.Данные.получить(Номенклатура) Цикл
				СтрТЧ=ДокументЗСБ_Объект.ШтрихкодыУпаковок.Добавить();
				СтрТЧ.ШтрихкодУпаковки=СтрокаДанных;
				СтрТЧ.ЗабронированПодСборку = Истина;
			КонецЦикла;
		КонецЦикла;	
		
	КонецЕсли;	
	
	ДокументЗСБ_Объект.Проведен=Истина;
	ДокументЗСБ_Объект.Записать();
	СтруктураРезультата.Данные.Добавить(ДокументЗСБ_Объект.ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистСборкиКомплектовЧЗ.Ссылка КАК Ссылка,
		|	ЛистСборкиКомплектовЧЗ.Завершен КАК Завершен
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
		|ГДЕ
		|	ЛистСборкиКомплектовЧЗ.Проведен
		|	И ЛистСборкиКомплектовЧЗ.ДокОснование = &ДокОснование";
	
	Запрос.УстановитьПараметр("ДокОснование", ДокументЗСБ_Объект.ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Если ВыборкаДетальныеЗаписи.Завершен  Тогда
			
			ТекстОшибки = СтрШаблон("ЛСК завершен, редактирование запрещено, ЛСК %1",ВыборкаДетальныеЗаписи.ссылка); 	
			СтруктураРезультата.Ошибки.Добавить(ТекстОшибки);
			Возврат СтруктураРезультата;	
			
		КонецЕсли;
		
		ЛСКСозданный = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект(); 
	КонецЕсли; 
	
	Если ЛСКСозданный = Неопределено Тогда
		
		ЛСКОбъект = Документы.ЛистСборкиКомплектовЧЗ.СоздатьДокумент();
		
	Иначе 
		ЛСКОбъект = ЛСКСозданный;
		ЛСКОбъект.Товары.Очистить();
		ЛСКОбъект.ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ЛСКОбъект.Дата = ТекущаяДатаСеанса();
	ЛСКОбъект.Заполнить(ДокументЗСБ_Объект.ссылка);
	ЛСКОбъект.ДатаНачалаСканирования = ТекущаяДатаСеанса();
	ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);   
	
	ТРШтрихкоды = Документы.ЛистСборкиКомплектовЧЗ.СоздатьДокумент().ШтрихкодыУпаковок.ВыгрузитьКолонки();
	ВсеКодыКомплектующих = Новый Массив;
	Для Каждого СтрокаПродукции Из ТЧТовары Цикл
		Продукция = СтрокаПродукции.Номенклатура;
		КоличествоПродукции = СтрокаПродукции.Количество;

		КодыПродукции = РезультатПолученияКодов.Данные[Продукция];

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремаркировкаТовары.Номенклатура КАК Номенклатура,
		               |	ПеремаркировкаТовары.Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		               |	ПеремаркировкаТовары.Количество КАК Количество,
		               |	ПеремаркировкаТовары.Продукция КАК Продукция
		               |ИЗ
		               |	Документ.Перемаркировка.Комплектующие КАК ПеремаркировкаТовары
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемаркировка КАК Перемаркировка
		               |		ПО ПеремаркировкаТовары.Ссылка = Перемаркировка.Ссылка
		               |ГДЕ
		               |	Перемаркировка.Ссылка = &Ссылка
		               |	И ПеремаркировкаТовары.Продукция = &Продукция
		               |	И ПеремаркировкаТовары.Номенклатура.Родитель.ТНВЭД <> ЗНАЧЕНИЕ(Справочник.ТНВЭД.ПустаяСсылка)
		               |	И ПеремаркировкаТовары.Номенклатура.Родитель.ВидНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар), ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.ПустаяСсылка))
		               |	И НЕ(ПеремаркировкаТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
		               |				ИЛИ ПеремаркировкаТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))";

		Запрос.УстановитьПараметр("Продукция", Продукция);
		Запрос.УстановитьПараметр("Ссылка", ДокПеремаркировки);
		Выборка = Запрос.Выполнить().Выбрать();
		ДатаФормированияКомплекта = ТекущаяДатаСеанса(); 
		Пока Выборка.Следующий() Цикл
			КолВОднойЕдинице = Выборка.Количество/КоличествоПродукции;
			Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
				Количество	= Выборка.Количество;				 
				ДопПараметры = Новый Структура("Количество,Период,НовыйСтатус,Добавлять", Количество,
					ДатаФормированияКомплекта, Перечисления.СтатусыКодовМаркировкиФакт.Вложен, Истина);
				рПолучения	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(
					Выборка.Номенклатура, ЛСКОбъект.ссылка, ДопПараметры);
				Если рПолучения.Успешно Тогда
					КодыКомплектующих = Новый Массив;
					Для Каждого КиЗ Из рПолучения.Данные Цикл
						Для Каждого ШтрихкодУпаковки Из КиЗ.Значение Цикл
							ВсеКодыКомплектующих.Добавить(ШтрихкодУпаковки);
							КодыКомплектующих.Добавить(ШтрихкодУпаковки);
						КонецЦикла;
					КонецЦикла;

					Для НомерКомплекта = 0 По КоличествоПродукции - 1 Цикл
						Для НомерПродукции = 0 По КолВОднойЕдинице - 1 Цикл
							СтрокаТР = ТРШтрихкоды.Добавить();
							СтрокаТР.ШтрихкодКомплекта			= КодыПродукции[НомерКомплекта];
							СтрокаТР.Комплектующее 				= Выборка.Номенклатура;
							СтрокаТР.ШтрихкодУпаковки   		= КодыКомплектующих[НомерКомплекта * КолВОднойЕдинице
								+ НомерПродукции];
							СтрокаТР.КодКомплектующегоНеНанесен = Истина;
							СтрокаТР.ДатаФормированияКомплекта  = ДатаФормированияКомплекта;
						КонецЦикла;
					КонецЦикла;
				Иначе
					МаркировкаКС.ДобавитьОшибки(СтруктураРезультата, рПолучения);
					Прервать;
				КонецЕсли;
			Иначе
				Для НомерКомплекта = 0 По КоличествоПродукции - 1 Цикл
					Для НомерПродукции = 0 По КолВОднойЕдинице - 1 Цикл
						СтрокаТР = ТРШтрихкоды.Добавить();

						СтрокаТР.ШтрихкодКомплекта			= КодыПродукции[НомерКомплекта];
						СтрокаТР.Комплектующее 				= Выборка.Номенклатура;
						СтрокаТР.КодКомплектующегоНеНанесен = Истина;
						СтрокаТР.ДатаФормированияКомплекта  = ДатаФормированияКомплекта;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
	Если СтруктураРезультата.Ошибки.Количество() = 0 Тогда
		РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(ВсеКодыКомплектующих,
			Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально, ЛСКОбъект.ссылка,
			Новый Структура("Добавлять,Период,ИспользоватьУправляемыеБлокировки", Истина, ДатаФормированияКомплекта
			- 1, Истина));
		
		ЛСКОбъект.ШтрихкодыУпаковок.Загрузить(ТРШтрихкоды);
		ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Для Каждого СтрокаШКЗСБ Из ДокументЗСБ_Объект.ШтрихкодыУпаковок Цикл
			СтрокаШКЗСБ.ЛистСборки = ЛСКОбъект.ссылка;
		КонецЦикла;
		ДокументЗСБ_Объект.Записать(); 
		СтруктураРезультата.Данные.Добавить(ЛСКОбъект.ссылка); 
	КонецЕсли;
	СтруктураРезультата.Успешно = СтруктураРезультата.ошибки.Количество() = 0; 	
	Возврат СтруктураРезультата; 
	
КонецФункции

Функция ЗавершитьПеремаркировку(Знач ДокПеремаркировки) Экспорт

	УстановитьСтатусПеремаркировки(ДокПеремаркировки,Перечисления.СтатусыПеремаркировки.Обработано);  
	
КонецФункции // ЗаврешитьПеремаркировку()

Процедура УстановитьСтатусПеремаркировки(ДокПеремаркировки,Статус) Экспорт 
	
	Если ПроверитьВозможностьИзмененияСтатуса(ДокПеремаркировки,Статус) Тогда
		
		ДокПеремаркировкиОбъект = ДокПеремаркировки.ПолучитьОбъект();		                         
		ДокПеремаркировкиОбъект.Статус = Статус;
		ДокПеремаркировкиОбъект.Записать(РежимЗаписиДокумента.Проведение);	
		
	КонецЕсли;
	

КонецПроцедуры 

Функция ПроверитьВозможностьИзмененияСтатуса(ДокПеремаркировки,Статус)
    ВозможныеСтатусы = Новый Массив; 
	Если Статус = Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ  Тогда
		
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.ВРаботе); 
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ);
	//++Данилова Е.В. 26.06.2026 Изм.№0000000222 
	ИначеЕсли Статус = Перечисления.СтатусыПеремаркировки.КОтправкеНаСклад  Тогда
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.ВРаботе); 
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ);
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ);
	//--Данилова Е.В. 26.06.2026 	
	ИначеЕсли Статус = Перечисления.СтатусыПеремаркировки.ПолученоСкладом  Тогда
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.ВРаботе); 
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ);
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ);
		//++Данилова Е.В. 26.06.2026 Изм.№0000000222
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.КОтправкеНаСклад);
        //--Данилова Е.В. 26.06.2026 
	ИначеЕсли Статус = Перечисления.СтатусыПеремаркировки.Обработано  Тогда
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.ВРаботе); 
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ);
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ); 
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.ПолученоСкладом);
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.Сканирование);
		//++Данилова Е.В. 26.06.2026 Изм.№0000000222
		ВозможныеСтатусы.Добавить(Перечисления.СтатусыПеремаркировки.КОтправкеНаСклад);
        //--Данилова Е.В. 26.06.2026
	КонецЕсли;
	
	Возврат ВозможныеСтатусы.Найти(ДокПеремаркировки.Статус) <> неопределено; 	
КонецФункции // ПроверитьВозможностьИзмененияСтатуса()

Функция ВсеДокументыЧЗОтработаны(Знач Перемаркировка) Экспорт
	
	СтруктураРезультата = МаркировкаКС.СтруктураРезультата(Ложь); 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Статус КАК Статус,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ВидКомплекта КАК ВидКомплекта
		|ПОМЕСТИТЬ ВТОсновныеЗаказы
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ДокументОснование
		|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Статус КАК Статус,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ВидКомплекта КАК ВидКомплекта
		|ПОМЕСТИТЬ ВТЗаказыКМ
		|ИЗ
		|	ВТОсновныеЗаказы КАК ВТОсновныеЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|		ПО ВТОсновныеЗаказы.Ссылка = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование
		|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОсновныеЗаказы.Ссылка КАК ЗаказКМ,
		|	ВТОсновныеЗаказы.Статус КАК СтатусЗаказа,
		|	ЕСТЬNULL(МаркировкаТоваровИСМП.Ссылка, ЗНАЧЕНИЕ(Документ.МаркировкаТоваровИСМП.ПустаяСсылка)) КАК ОМ,
		|	МаркировкаТоваровИСМП.Статус КАК СтатусОМ
		|ИЗ
		|	ВТОсновныеЗаказы КАК ВТОсновныеЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|		ПО ВТОсновныеЗаказы.Ссылка = МаркировкаТоваровИСМП.ДокументОснование
		|			И (МаркировкаТоваровИСМП.Проведен)
		|			И (МаркировкаТоваровИСМП.ВидОперации = &ФормированиеНаборов)
		|ГДЕ
		|	ВТОсновныеЗаказы.ВидКомплекта = &ГотовыйКомплект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТОсновныеЗаказы.Ссылка,
		|	ВТОсновныеЗаказы.Статус,
		|	ЕСТЬNULL(МаркировкаТоваровИСМП.Ссылка, ЗНАЧЕНИЕ(Документ.МаркировкаТоваровИСМП.ПустаяСсылка)),
		|	МаркировкаТоваровИСМП.Статус
		|ИЗ
		|	ВТОсновныеЗаказы КАК ВТОсновныеЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|		ПО ВТОсновныеЗаказы.Ссылка = МаркировкаТоваровИСМП.ДокументОснование
		|			И (МаркировкаТоваровИСМП.Проведен)
		|			И (МаркировкаТоваровИСМП.ВидОперации = &Перемаркировка)
		|ГДЕ
		|	ВТОсновныеЗаказы.ВидКомплекта = &Товар
		|
		//++Данилова Е.В. 23.06.2026 Проб.№0000000129
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ВТЗаказыКМ.Ссылка,
		//|	ВТЗаказыКМ.Статус,
		//|	ЕСТЬNULL(МаркировкаТоваровИСМП.Ссылка, ЗНАЧЕНИЕ(Документ.МаркировкаТоваровИСМП.ПустаяСсылка)),
		//|	МаркировкаТоваровИСМП.Статус
		//|ИЗ
		//|	ВТЗаказыКМ КАК ВТЗаказыКМ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		//|		ПО ВТЗаказыКМ.Ссылка = МаркировкаТоваровИСМП.ДокументОснование
		//|			И (МаркировкаТоваровИСМП.Проведен)
		//|			И (МаркировкаТоваровИСМП.ВидОперации = &Перемаркировка)
		//|   
		 
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТЗаказыКМ.Ссылка,
		|	ВТЗаказыКМ.Статус,
		|	ЕСТЬNULL(МаркировкаТоваровИСМП.Ссылка, ЗНАЧЕНИЕ(Документ.МаркировкаТоваровИСМП.ПустаяСсылка)),
		|	МаркировкаТоваровИСМП.Статус
		|ИЗ
		|	ВТОсновныеЗаказы КАК ВТЗаказыКМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|		ПО ВТЗаказыКМ.Ссылка = МаркировкаТоваровИСМП.ДокументОснование
		|			И (МаркировкаТоваровИСМП.Проведен)
		|			И (МаркировкаТоваровИСМП.ВидОперации = &Перемаркировка)
		|ГДЕ
		|	ВТЗаказыКМ.ВидКомплекта = &Спайка";
		//--Данилова Е.В. 23.06.2026
	
	Запрос.УстановитьПараметр("Товар", Перечисления.ВидыКомплектов.Товар);
	Запрос.УстановитьПараметр("ДокументОснование", Перемаркировка);
	Запрос.УстановитьПараметр("ГотовыйКомплект", Перечисления.ВидыКомплектов.ГотовыйКомплект);
	Запрос.УстановитьПараметр("ФормированиеНаборов", Перечисления.ВидыОперацийМаркировки.ФормированиеНабора);
	Запрос.УстановитьПараметр("Спайка", Перечисления.ВидыКомплектов.Комплект);
	Запрос.УстановитьПараметр("Перемаркировка", Перечисления.ВидыОперацийМаркировки.Перемаркировка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураРезультата; 
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СтатусЗаказа <> перечисления.СтатусыДокументовМаркировки.Обработан Тогда
			ТекстОшибки = СтрШаблон("Заказ КМ %1 не обработан, статус %2", ВыборкаДетальныеЗаписи.ЗаказКМ,
				ВыборкаДетальныеЗаписи.Статусзаказа);
			СтруктураРезультата.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ОМ  =  Документы.МаркировкаТоваровИСМП.ПустаяСсылка() Тогда
			ТекстОшибки = СтрШаблон("Не найдена ОМ по заказу %1", ВыборкаДетальныеЗаписи.ЗаказКМ);
			СтруктураРезультата.Ошибки.Добавить(ТекстОшибки);
		ИначеЕсли ВыборкаДетальныеЗаписи.СтатусОМ <> перечисления.СтатусыДокументовМаркировки.Обработан Тогда
			ТекстОшибки = СтрШаблон("ОМ  %1 не обработан, статус %2", ВыборкаДетальныеЗаписи.ОМ,
				ВыборкаДетальныеЗаписи.СтатусОМ);
			СтруктураРезультата.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	СтруктураРезультата.Успешно = СтруктураРезультата.Ошибки.Количество() = 0; 
	
	Возврат СтруктураРезультата; 
	
КонецФункции

Функция ОтработкаПоПеремаркировке(Знач ЗаказКМОснование) Экспорт
	 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК Перемаркировка
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка = &ЗаказКМПоОм
		|	И ТИПЗНАЧЕНИЯ(ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование) = ТИП(Документ.Перемаркировка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ1.ДокументОснование КАК Перемаркировка
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ1
		|		ПО ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = ЗаказНаЭмиссиюКодовМаркировкиСУЗ1.ссылка
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка = &ЗаказКМПоОм
		|	И ТИПЗНАЧЕНИЯ(ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование) = ТИП(Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ)
		|	И ТИПЗНАЧЕНИЯ(ЗаказНаЭмиссиюКодовМаркировкиСУЗ1.ДокументОснование) = ТИП(Документ.Перемаркировка)";
	
	Запрос.УстановитьПараметр("ЗаказКМПоОм", ЗаказКМОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат неопределено; 
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Перемаркировка; 
	КонецЕсли;
КонецФункции

//++Данилова Е.В. 24.06.2026 Проб.№0000000129  
Функция ПолучитьТаблицуКомплектующихПоЗаказуКМ(Знач ЗаказКМ, Знач ДокПеремаркировки)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура КАК Номенклатура,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|ГДЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка = &ЗаказКМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремаркировкаКомплектующие.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА СУММА(ПеремаркировкаКомплектующие.КоличествоПродукции) = 0
	|			ТОГДА МАКСИМУМ(ВТТовары.Количество)
	|		ИНАЧЕ СУММА(ПеремаркировкаКомплектующие.Количество) / СУММА(ПеремаркировкаКомплектующие.КоличествоПродукции) * МАКСИМУМ(ВТТовары.Количество)
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.Перемаркировка.Комплектующие КАК ПеремаркировкаКомплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТовары КАК ВТТовары
	|		ПО ПеремаркировкаКомплектующие.Продукция = ВТТовары.Номенклатура
	|ГДЕ
	|	ПеремаркировкаКомплектующие.Ссылка = &Ссылка
	|	И ПеремаркировкаКомплектующие.Номенклатура.Родитель.ТНВЭД <> ЗНАЧЕНИЕ(Справочник.ТНВЭД.ПустаяСсылка)
	|	И ПеремаркировкаКомплектующие.Номенклатура.Родитель.ВидНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар), ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.ПустаяСсылка))
	|	И НЕ(ПеремаркировкаКомплектующие.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	|				ИЛИ ПеремаркировкаКомплектующие.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремаркировкаКомплектующие.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", ДокПеремаркировки);
	Запрос.УстановитьПараметр("ЗаказКМ", ЗаказКМ);

	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить();	

КонецФункции // ПолучитьТаблицуКомплектующихПоЗаказуКМ()
//--Данилова Е.В. 24.06.2026 
#КонецОбласти
